dynamicMeshSingleRegion/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Note: this file is a Copy of $FOAM_TUTORIALS/resources/blockMesh/pitzDaily

convertToMeters 0.001;

myOffsetX 0;
myOffsetY 100;
myOffsetZ 0;


vertices
(
    (-50 50 0)
    (50 50 0)
    (50 150 0)
    (-50 150 0)
    (-50 50 150)
    (50 50 150)
    (50 150 150)
    (-50 150 150)
);


blocks
(
    hex (0 1 2 3 4 5 6 7)
    (30 30 10)
    simpleGrading (1 1 1)

);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (2 6 7 3)
            (1 5 6 2)
            (0 4 5 1)
            (0 4 7 3)
        );
    }

);

// ************************************************************************* //
